<template>
    <ComponentLayout>
        
            <div class="w-full flex justify-center mt-[5rem]">
                <span class=" font-bold text-[3rem]">BitIP用户服务协议</span>
            </div>
            <p><strong>第一条 总则</strong><br /></p>
            <p>1.1 您在使用BitIP服务之前，应充分阅读、理解并接受本协议的全部内容。一旦您完成账号注册或使用本服务，即表示您同意遵循本协议的所有条款。</p>
            <p>1.2 BitIP保留随时更新本协议及相关服务规则的权利。更新后的协议或规则将通过官网公告或其他适当方式通知您。若您不同意更新内容，您有权在新的协议或规则生效前终止使用本服务。若您继续使用本服务，则视为您接受更新内容。</p>
            <p>1.3 您应具备完全民事权利能力和行为能力。若您为未成年人，应在法定监护人的陪同下阅读并判断是否同意本协议。</p>
            <p><strong>第二条 协议的范围</strong><br /></p>
            <p>2.1 本协议是用户与BitIP之间关于使用BitIP服务的约定。&ldquo;BitIP&rdquo;指BitIP及其关联公司，&ldquo;用户&rdquo;指使用BitIP服务的个人或企业。</p>
            <p>2.2 BitIP服务包括但不限于IP代理、数据采集等相关服务，具体以BitIP实际提供的为准。</p>
            <p>2.3 本协议包括《BitIP隐私协议》及其他单独协议，您对任何单独协议的接受即视为对本协议的接受。</p>
            <p><strong>第三条 账号与密码安全</strong><br /></p>
            <p>3.1 您需注册BitIP账号以使用服务。注册时，您应提供真实、准确、完整的信息，并及时更新。</p>
            <p>3.2 您应对账号下的所有行为负责，不得将账号提供给他人使用。</p>
            <p>3.3 BitIP有权要求您完成实名认证，以确保账户和交易安全。</p>
            <p>3.4 您应妥善保管账号和密码，因保管不善导致的损失由您自行承担。</p>
            <p><strong>第四条 隐私及个人信息保护</strong><br /></p>
            <p>4.1 BitIP将按照《BitIP隐私协议》收集、使用和保护您的个人信息。</p>
            <p>4.2 您需提供真实身份信息以使用服务，否则可能受到限制。</p>
            <p>4.3 BitIP承诺对您的信息保密，除非法律法规要求或您明确同意，否则不会向第三方披露。</p>
            <p>4.4 BitIP将采取合理措施保护您的信息安全，但不承诺绝对安全。</p>
            <p><strong>第五条 服务内容</strong><br /></p>
            <p>5.1 您应通过BitIP提供或认可的方式使用服务，不得干扰、破坏或修改服务。</p>
            <p>5.2 BitIP可能根据需要对收费服务的收费标准、方式进行修改，并通过官网公告通知您。</p>
            <p>5.3 服务按现状提供，BitIP不保证服务的连续性、无错误或完全安全。</p>
            <p>5.4 BitIP有权因维护、经营策略调整等原因中止、变更或终止服务，且无需承担由此产生的责任。</p>
            <p><strong>第六条 第三方服务</strong><br /></p>
            <p>若您通过BitIP使用第三方服务，相关责任由第三方承担，BitIP仅在自身责任范围内承担责任。</p>
            <p><strong>第七条 用户行为规范</strong><br /></p>
            <p>7.1 您不得利用BitIP服务从事违法违规行为，包括但不限于传播违法信息、侵犯他人权益等。</p>
            <p>7.2 若您违反本协议，BitIP有权采取暂停或终止服务、追究法律责任等措施。</p>
            <p><strong>第八条 知识产权</strong><br /></p>
            <p>8.1 BitIP服务中的内容（如文字、图片等）的知识产权归BitIP所有，您在使用服务中产生的内容归您或相关权利人所有。</p>
            <p>8.2 未经BitIP或相关权利人书面许可，任何人不得擅自使用或创造衍生作品。</p>
            <p><strong>第九条 不可抗力及免责</strong><br /></p>
            <P>9.1 因不可抗力（如自然灾害、政府行为等）导致的服务中断或损失，BitIP不承担责任。</P>
            <p>9.2 BitIP对因计算机病毒、黑客攻击、设备故障等非自身过错导致的服务异常不承担责任。</p>
            <p><strong>第十条 法律适用与争议解决</strong><br /></p>
            <p>10.1 本协议适用中华人民共和国法律。</p>
            <p>10.2 因本协议产生的争议，双方应协商解决；协商不成的，任何一方可向协议签订地有管辖权的人民法院提起诉讼。</p>
            <p><strong>第十一条 其他</strong><br /></p>
            <p>11.1 若您对本协议或服务有意见或建议，请联系BitIP客服：support@bitip.com。</p>
            <p>&nbsp;</p>
    </ComponentLayout>
</template>
<script setup lang="ts">
    import ComponentLayout from '../ComponentLayout.vue';
</script>
<style scoped>
    p {
        font-family: "Alibaba Sans";
    }
</style>